tap 'homebrew/bundle'
tap 'caskroom/cask'
tap 'caskroom/versions'

# Productivity Apps
cask "google-chrome"
cask "google-chrome-canary"
cask "google-backup-and-sync" #Google Drive
cask "skype"
cask "firefox"
cask "macdown"
cask "dropbox"
cask "virtualbox"
mas "Slack", id: 803453959
mas "Pixelmator", id: 407963104
mas "Xcode", id: 497799835 
mas "Todoist", id: 585829637 
mas "SystemPal", id: 453164367
mas "1Password", id: 443987910
mas "LastPass", id: 926036361

# Tools
# cask "spectacle"

# Development Apps
cask "sourcetree"
cask "github-desktop"
cask "diffmerge"
cask "java"

# System tools
cask "iterm2"
brew "gpg"
brew "git"
brew "wget"
brew "bash-completion"
brew "tree"
cask "imageoptim"
brew "aria2"
brew "git-extras"
brew "git-flow"
brew "jq"
brew "tmux"


# Dev Tools/Languages
brew "vim"
brew "node"
brew "python3"
brew "go"
brew "postgres"
